In [ ]:
# This assignment focuses on dataframes
# First off, using a method of your choice, make a dataframe with the columns:
# EmployeeID, Age, Salary, Job Title
# Fill this out with arbitrary but sensible inputs for 5 rows.
# Ensure age and salary are stored as the right type of data for numbers, and that there's a good range of salaries

In [32]:
import pandas as pd

data = {
    'Employee_ID': [24601, 24621, 33621, 28965, 88567],
    'Age': [41, 24, 32, 24, 27],
    'Salary': [36000, 28000, 45000, 29500, 33000],
    'Job_Title': ['Performance Analyst', 'Data Analyst', 'Manager', 'Data Analyst', 'Project Manager']
}

company_1 = pd.DataFrame(data)

#company_1
#company_1.info()

In [ ]:
# Use pandas methods to find the maximum and minimum salaries and ages
# Find the sum of all the salaries using pandas methods
# Find the mean age 
# A little more tricky: find the longest name and print it, and its length
# Assign to an appropriately named variable a slice of the dataframe where all the salaries are above the median
# To a different appropriately named variable, slice the dataframe to have only those above the median age who also have a letter (of your choice) at least once in their name

In [37]:
max_salary, min_salary, max_age, min_age, salary_total, mean_age = (
    company_1['Salary'].max(),
    company_1['Salary'].min(),
    company_1['Age'].max(),
    company_1['Age'].min(),
    company_1['Salary'].sum(),
    company_1['Age'].mean()
)

#calculate the length of each job title
company_1['Title_Length'] = company_1['Job_Title'].str.len()

# Find the longest job title
longest_title = company_1['Job_Title'].max()
title_length = len(longest_title)


print(f'The maximum salary is: £{max_salary}\n'
      f'The minimum salary is: £{min_salary}\n'
      f'The maximum age is: {max_age}\n'
      f'The minimum age is: {min_age}\n'
      f'The salary total is: £{salary_total}\n'
      f'The mean age is: {mean_age}\n')

print(f"The longest job title is: {longest_title} (Length: {title_length})")

company_1

The maximum salary is: £45000
The minimum salary is: £28000
The maximum age is: 41
The minimum age is: 24
The salary total is: £171500
The mean age is: 29.6

The longest job title is: Project Manager (Length: 15)

   Employee_ID  Age  Salary            Job_Title  Title_Length
0        24601   41   36000  Performance Analyst            19
1        24621   24   28000         Data Analyst            12
2        33621   32   45000              Manager             7
3        28965   24   29500         Data Analyst            12
4        88567   27   33000      Project Manager            15

In [38]:
# Calculate the median salary
median_salary = company_1['Salary'].median()

# Create a slice with salaries above the median
above_median_df = company_1[company_1['Salary'] > median_salary]

# Print the resulting DataFrame
print(above_median_df)

   Employee_ID  Age  Salary            Job_Title  Title_Length
0        24601   41   36000  Performance Analyst            19
2        33621   32   45000              Manager             7

In [41]:
# Filter rows with age above the median
above_median_df = company_1[company_1['Age'] > median_age]

# Choose a specific letter (e.g., 'A')
target_letter = 'A'

# Filter rows with names containing the target letter
filtered_df = above_median_df[above_median_df['Job_Title'].str.contains(target_letter, case=False)]

filtered_df

   Employee_ID  Age  Salary            Job_Title  Title_Length
0        24601   41   36000  Performance Analyst            19
2        33621   32   45000              Manager             7